#+startup: folded indent
#+property: header-args:R :results value :session *R:dataset* :colnames yes

* Dataset for Quants Finance
** ~sp500ret~ from ~{rugarch}~

- S&P 500 指数の日足終値をベースにした対数収益率
- データソースは、Yahoo Finance
- 1987-03-10 から 2009-01-30 まで
- ~data.frame~ 形式
- rowname が日付になっている

#+begin_src R :rownames yes
library(rugarch)
data(sp500ret)
tail(sp500ret)
#+end_src

#+results: 
|            |            SP500RET |
|------------+---------------------|
| 2009-01-23 | 0.00536323561029839 |
| 2009-01-26 |  0.0055378560725865 |
| 2009-01-27 |  0.0108663123082273 |
| 2009-01-28 |  0.0330068339400373 |
| 2009-01-29 | -0.0336810510753152 |
| 2009-01-30 | -0.0230528095903741 |

** ~sp500~ from ~{depmixS4}~

- S&P 500 指数の月足四本値と終値ベースの対数収益率
- 1950-02-28 から 2012-01-31 まで
- ~data.frame~ 形式
- rowname が日付になっている

#+begin_src R :results value :colnames yes :rownames yes
library(depmixS4)
data(sp500)
tail(sp500)
#+end_src

#+results: 
|            |    Open |    High |     Low |   Close |     Volume |               logret |
|------------+---------+---------+---------+---------+------------+----------------------|
| 2011-08-31 |    1213 | 1230.71 | 1209.35 | 1218.89 | 5267840000 |  -0.0584674916191208 |
| 2011-09-30 | 1159.93 | 1159.93 | 1131.34 | 1131.42 | 4416790000 |  -0.0744671275427828 |
| 2011-10-31 | 1284.96 | 1284.96 | 1253.16 |  1253.3 | 4310210000 |     0.10230659165059 |
| 2011-11-30 | 1196.72 | 1247.11 | 1196.72 | 1246.96 | 5801910000 | -0.00507148343668096 |
| 2011-12-30 | 1262.82 | 1264.12 | 1257.46 |  1257.6 | 2271850000 |  0.00849655349414657 |
| 2012-01-31 | 1313.53 | 1321.41 | 1306.69 | 1312.41 | 4235550000 |   0.0426599990111374 |

** ~FANG~ from ~{tidyquant}~

- FANG (Facebook, Amazon, Netflix, Goolge) の日足四本値
- ~data.frame~ 形式
- 2013-01-02 から 2016-12-30 まで

#+begin_src R :results value :colnames yes
library(tidyquant)
data(FANG)
# 見やすいように小数点以下第二位までに四捨五入
dplyr::mutate_if(FANG, is.numeric, round, digit =  2) %>% tail()
#+end_src

#+results: 
| symbol |       date |   open |   high |    low |  close |  volume | adjusted |
|--------+------------+--------+--------+--------+--------+---------+----------|
| GOOG   | 2016-12-22 | 792.36 | 793.32 | 788.58 | 791.26 |  969100 |   791.26 |
| GOOG   | 2016-12-23 |  790.9 | 792.74 | 787.28 | 789.91 |  623400 |   789.91 |
| GOOG   | 2016-12-27 | 790.68 | 797.86 | 787.66 | 791.55 |  789100 |   791.55 |
| GOOG   | 2016-12-28 |  793.7 | 794.23 |  783.2 | 785.05 | 1132700 |   785.05 |
| GOOG   | 2016-12-29 | 783.33 | 785.93 | 778.92 | 782.79 |  742200 |   782.79 |
| GOOG   | 2016-12-30 | 782.75 | 782.78 | 770.41 | 771.82 | 1760200 |   771.82 |

** ~edhec~ from ~{PerformanceAnalytics}~

- EDHEC composite hedge fund style index returns
- 13 のスタイル別ヘッジファンドの月次リターンデータ
- ~xts~ 形式
- 1997-01-31 から 2009-08-31 まで

#+begin_src R :results value :colnames yes :rownames yes
library(PerformanceAnalytics)
data(edhec)
tail(edhec[, 1:4]) # 最初の4列のみ抽出
#+end_src

#+results: 
|   | Convertible Arbitrage | CTA Global | Distressed Securities | Emerging Markets |
|---+-----------------------+------------+-----------------------+------------------|
| 1 |                0.0235 |     -0.018 |                0.0022 |            0.035 |
| 2 |                  0.05 |     -0.014 |                0.0387 |           0.0663 |
| 3 |                0.0578 |     0.0213 |                0.0504 |           0.0884 |
| 4 |                0.0241 |    -0.0147 |                0.0198 |           0.0013 |
| 5 |                0.0611 |    -0.0012 |                0.0311 |           0.0451 |
| 6 |                0.0315 |     0.0054 |                0.0244 |           0.0166 |

